Revit 2026 API

# FabricationPartProductListEntry Property

---

The product entry index of the fabrication part. A value of -1 indicates the fabrication part is not a product list.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int ProductListEntry { get; set; }
```
```vb
Public Property ProductListEntry As Integer
	Get
	Set
```
```cpp
public:
property int ProductListEntry {
	int get ();
	void set (int value);
}
```
```fsharp
member ProductListEntry : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: modifying the product entry will cause the dimensions of connected ends to change. |
| ArgumentOutOfRangeException | When setting this property: The product entry index is not larger than 0 and less than GetProductCount. |
| InvalidOperationException | When setting this property: -or- When setting this property: the product entry fails to be set by index: productEntryIndex. |

The product list is a catalog of available sizes for the part and the index refers to the entry on this list.

#### Reference

FabricationPart Class

Autodesk.Revit.DB Namespace